Elecrow-RD/CrowPanel-Advance-2.8-HMI-ESP32-AI-Display-320x240/example/V1.1_and_V1.2/ESP_IDF/Lesson04-DHT_Screen_24_28/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_DHT20_SENSOR_ENABLED=y
CONFIG_DEVICE_I2C_ENABLED=y
CONFIG_I2C_GPIO_SCL=18
CONFIG_I2C_GPIO_SDA=17
CONFIG_I2C_GPIO_SCL_PULLUP=y
CONFIG_I2C_GPIO_SDA_PULLUP=y
CONFIG_I2C_MASTER_FREQUENCY=100000
